accountsProxy/accountsProxy/src/gateway/duMockTargetServer/apiproxy/resources/node/du-mocks/services/GetServiceStatus-Response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webservices.com/LCE/Du/WebServices" xmlns:head="http://www.du.ae/LCE/HeaderResponse" xmlns:lcew="http://xmlns.du.ae/LCE/Business/LCEWebServiceResponse" xmlns:get="http://xmlns.du.ae/LCE/Business/ServiceManagement/GetServiceStatus">
   <soapenv:Header/>
   <soapenv:Body>
      <web:GetServiceStatusResponse>
         <Response>
            <head:Header>
               <!--Optional:-->
               <head:RequestId>?</head:RequestId>
               <!--Optional:-->
               <head:CorrelationId>?</head:CorrelationId>
               <head:ResponseCode>?</head:ResponseCode>
               <!--Optional:-->
               <head:ResponseMessage>?</head:ResponseMessage>
               <!--Optional:-->
               <head:ErrorCode>?</head:ErrorCode>
               <!--Optional:-->
               <head:ErrorDescription>?</head:ErrorDescription>
            </head:Header>
            <!--Optional:-->
            <lcew:Body>
               <!--Optional:-->
               <get:CustomerID>?</get:CustomerID>
               <!--Optional:-->
               <get:CustomerIDPub>?</get:CustomerIDPub>
               <!--Optional:-->
               <get:CustomerType>?</get:CustomerType>
               <!--Optional:-->
               <get:ContractID>?</get:ContractID>
               <!--Optional:-->
               <get:ContractIDPub>?</get:ContractIDPub>
               <!--Optional:-->
               <get:ContractStatus>?</get:ContractStatus>
               <!--Optional:-->
               <get:RatePlanCode>?</get:RatePlanCode>
               <!--Optional:-->
               <get:RatePlanCodePub>?</get:RatePlanCodePub>
               <!--Optional:-->
               <get:RatePlanDesc>?</get:RatePlanDesc>
               <!--Optional:-->
               <get:RatePlanType>?</get:RatePlanType>
               <!--Optional:-->
               <get:MarketCode>?</get:MarketCode>
               <!--Optional:-->
               <get:MarketCodePub>?</get:MarketCodePub>
               <!--Optional:-->
               <get:ServiceList>
                  <!--Zero or more repetitions:-->
                  <get:ServiceNode>
                     <!--Optional:-->
                     <get:ServicePackageCode>?</get:ServicePackageCode>
                     <!--Optional:-->
                     <get:ServicePackageCodePub>?</get:ServicePackageCodePub>
                     <!--Optional:-->
                     <get:ServicePackageDesc>?</get:ServicePackageDesc>
                     <!--Optional:-->
                     <get:ServiceCode>?</get:ServiceCode>
                     <!--Optional:-->
                     <get:ServiceCodePub>?</get:ServiceCodePub>
                     <!--Optional:-->
                     <get:ServiceDesc>?</get:ServiceDesc>
                     <!--Optional:-->
                     <get:ServiceStatus>?</get:ServiceStatus>
                     <!--Optional:-->
                     <get:ServicePendingStatus>?</get:ServicePendingStatus>
                     <!--Optional:-->
                     <get:ProfileID>?</get:ProfileID>
                     <!--Optional:-->
                     <get:ServiceParameterInd>?</get:ServiceParameterInd>
                     <!--Optional:-->
                     <get:ServiceType>?</get:ServiceType>
                     <!--Optional:-->
                     <get:ServiceSubType>?</get:ServiceSubType>
                     <!--Optional:-->
                     <get:OneTimeCharge>?</get:OneTimeCharge>
                     <!--Optional:-->
                     <get:UsageCharge>?</get:UsageCharge>
                     <!--Optional:-->
                     <get:RecurringCharge>?</get:RecurringCharge>
                     <!--Optional:-->
                     <get:RecurringChargeInterval>?</get:RecurringChargeInterval>
                     <!--Optional:-->
                     <get:EventCharge>?</get:EventCharge>
                     <!--Optional:-->
                     <get:AdvanceRecurringCharge>?</get:AdvanceRecurringCharge>
                     <!--Optional:-->
                     <get:AdvanceRecurringChargeInterval>?</get:AdvanceRecurringChargeInterval>
                     <!--Optional:-->
                     <get:CoreServiceIndicator>?</get:CoreServiceIndicator>
                     <!--Optional:-->
                     <get:RequestedDepsoit>?</get:RequestedDepsoit>
                     <!--Optional:-->
                     <get:DirnumNpCode>?</get:DirnumNpCode>
                     <!--Optional:-->
                     <get:DirnumNpCodePub>?</get:DirnumNpCodePub>
                     <!--Optional:-->
                     <get:ServiceStatusDate>?</get:ServiceStatusDate>
                     <!--Optional:-->
                     <get:AdvanceAccessOvw>?</get:AdvanceAccessOvw>
                     <!--Optional:-->
                     <get:AdvanceAccessOvwPrd>?</get:AdvanceAccessOvwPrd>
                     <!--Optional:-->
                     <get:AdvanceAccessOvwType>?</get:AdvanceAccessOvwType>
                     <!--Optional:-->
                     <get:CalcAcc>?</get:CalcAcc>
                     <!--Optional:-->
                     <get:CalcAdvanceAcc>?</get:CalcAdvanceAcc>
                     <!--Optional:-->
                     <get:CalcSub>?</get:CalcSub>
                     <!--Optional:-->
                     <get:ServiceAccfeeOvw>?</get:ServiceAccfeeOvw>
                     <!--Optional:-->
                     <get:ServiceAccfeeOvwPrd>?</get:ServiceAccfeeOvwPrd>
                     <!--Optional:-->
                     <get:ServiceAccfeeOvwType>?</get:ServiceAccfeeOvwType>
                     <!--Optional:-->
                     <get:ServiceCurrency>?</get:ServiceCurrency>
                     <!--Optional:-->
                     <get:ServiceCurrencyPub>?</get:ServiceCurrencyPub>
                     <!--Optional:-->
                     <get:ServiceDateBilled>?</get:ServiceDateBilled>
                     <!--Optional:-->
                     <get:ServiceLastActDate>?</get:ServiceLastActDate>
                     <!--Optional:-->
                     <get:ServicePendingStatusDate>?</get:ServicePendingStatusDate>
                     <!--Optional:-->
                     <get:ServiceQuantity>?</get:ServiceQuantity>
                     <!--Optional:-->
                     <get:ServiceSubFeeOvw>?</get:ServiceSubFeeOvw>
                     <!--Optional:-->
                     <get:ServiceSubFeeOvwType>?</get:ServiceSubFeeOvwType>
                     <!--Optional:-->
                     <get:ServiceTrailEndDate>?</get:ServiceTrailEndDate>
                     <!--Optional:-->
                     <get:CoReqPending>?</get:CoReqPending>
                     <!--Optional:-->
                     <get:CsPaymentConditionUsgInd>?</get:CsPaymentConditionUsgInd>
                     <!--Optional:-->
                     <get:CsPrepaidTpID>?</get:CsPrepaidTpID>
                     <!--Optional:-->
                     <get:CsPrepaidTpIDPub>?</get:CsPrepaidTpIDPub>
                     <!--Optional:-->
                     <get:OrigAcc>?</get:OrigAcc>
                     <!--Optional:-->
                     <get:Reason>?</get:Reason>
                     <!--Optional:-->
                     <get:UserReason>?</get:UserReason>
                     <!--Optional:-->
                     <get:DirectoryNumberList>
                        <!--Zero or more repetitions:-->
                        <get:Directory_Number>
                           <!--Optional:-->
                           <get:BCCode>?</get:BCCode>
                           <!--Optional:-->
                           <get:CoscDNNP>?</get:CoscDNNP>
                           <!--Optional:-->
                           <get:CoscDNNPPub>?</get:CoscDNNPPub>
                           <!--Optional:-->
                           <get:CoscDNStatus>?</get:CoscDNStatus>
                           <!--Optional:-->
                           <get:CoscLinkedPublicDirnum>?</get:CoscLinkedPublicDirnum>
                           <!--Optional:-->
                           <get:CoscLinkedPublicDirnumNp>?</get:CoscLinkedPublicDirnumNp>
                           <!--Optional:-->
                           <get:CoscLinkedPublicDirnumNpPub>?</get:CoscLinkedPublicDirnumNpPub>
                           <!--Optional:-->
                           <get:CoscLinkedPublicDnID>?</get:CoscLinkedPublicDnID>
                           <!--Optional:-->
                           <get:CoscPendingDnStatus>?</get:CoscPendingDnStatus>
                           <!--Optional:-->
                           <get:Dirnum>?</get:Dirnum>
                           <!--Optional:-->
                           <get:DirnumOnBill>?</get:DirnumOnBill>
                           <!--Optional:-->
                           <get:DnbStatus>?</get:DnbStatus>
                           <!--Optional:-->
                           <get:DnActivationDate>?</get:DnActivationDate>
                           <get:DnDeactivationDate>?</get:DnDeactivationDate>
                           <!--Optional:-->
                           <get:DnID>?</get:DnID>
                           <!--Optional:-->
                           <get:ExternalFlag>?</get:ExternalFlag>
                           <!--Optional:-->
                           <get:LowerExt>?</get:LowerExt>
                           <!--Optional:-->
                           <get:MainDirnum>?</get:MainDirnum>
                           <!--Optional:-->
                           <get:PendingBcCode>?</get:PendingBcCode>
                           <!--Optional:-->
                           <get:PendingDnbStatus>?</get:PendingDnbStatus>
                           <!--Optional:-->
                           <get:UpperExt>?</get:UpperExt>
                           <!--Optional:-->
                           <get:VpnID>?</get:VpnID>
                           <!--Optional:-->
                           <get:VpnIDPub>?</get:VpnIDPub>
                        </get:Directory_Number>
                     </get:DirectoryNumberList>
                     <!--Optional:-->
                     <get:PortsList>
                        <!--Zero or more repetitions:-->
                        <get:Port>
                           <!--Optional:-->
                           <get:CospPortNum>?</get:CospPortNum>
                           <!--Optional:-->
                           <get:CospStatus>?</get:CospStatus>
                           <!--Optional:-->
                           <get:CospPortNp>?</get:CospPortNp>
                           <!--Optional:-->
                           <get:CospPortNpPub>?</get:CospPortNpPub>
                        </get:Port>
                     </get:PortsList>
                  </get:ServiceNode>
               </get:ServiceList>
            </lcew:Body>
         </Response>
      </web:GetServiceStatusResponse>
   </soapenv:Body>
</soapenv:Envelope>